---
type: DistributionSysTypeSetIterator
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 4
tags: [revit-api, class]
---

# DistributionSysTypeSetIterator

`Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DistributionSysTypeSetIterator | — | `public DistributionSysTypeSetIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |